RubyAPI/app/controllers/food_controller.rb

INSERT INTO "foods" ("dish", "measurement", "description", "ingredient", "spice") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["dish", "Oregano"], ["measurement", "1/4 pint"], ["description", "Eaque at autem aut quae."], ["ingredient", "Rye"], ["spice", "Cumin Seed Black"]]
---
  def create
    meal = Food.new(meal_params)

    if meal.save